# WorksetKindFilter Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetKindFilter Class
Members See Also
---
A filter used to match worksets of the given WorksetKind.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class WorksetKindFilter : WorksetFilter
```

Visual Basic
---
```text
Public Class WorksetKindFilter _
	Inherits WorksetFilter
```

Visual C++
---
```text
public ref class WorksetKindFilter : public WorksetFilter
```

# Remarks
This filter is a quick filter.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..WorksetFilter Autodesk.Revit.DB..::..WorksetKindFilter
# See Also
WorksetKindFilter Members
Autodesk.Revit.DB Namespace